<template>
  <div class="about">
    <div class="container">
      <Breadcrumbs :cat="cat" />
      <div class="about__wrap">
        <div class="about__wrap-item" v-for="item in info" :key="item.title">
          <div class="about-item-img">
            <img :src="item.img" alt="" />
          </div>
          <div class="about-item-text">
            <span class="orange-line"></span>
            <h3>{{ item.title }}</h3>
            <p v-html="item.text"></p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import Breadcrumbs from "./ui/Breadcrumbs.vue";
export default {
  components: { Breadcrumbs },
  name: "About",
  data() {
    return {
      cat: {
        slug: "/about",
        text: "О компании",
      },
      info: [
        {
          title: "Мы рады приветствовать Вас на сайте нашей компании.",
          img: require("../assets/img/about-1.png"),
          text: "<p>Прежде всего, хотел бы выразить благодарность всем нашимзаказчикам, партнерам и коллегам за доверие и успешноесотрудничество, обеспечивающее успех и динамичное развитие нашейорганизации. <br /><br />Верное, надежное и плодотворное сотрудничество – это то, что мывсегда можем гарантировать Вам! <br /><br />Компания «ДАФ» существует с 2010 года, осуществляя для Вас услугикак по строительству, ремонту, эксплуатации дорог и искусственныхсооружений, благоустройству территорий, так и проектированию. Мыориентированы, прежде всего, на качественную работу с соблюдениемустановленных сроков, стремимся соответствовать потребностямрынка, соблюдая стандарты и нормы отрасли, проявляяпрофессионализм, внедряя информационные технологии и ведя гибкую,адекватную ценовую политику.p>",
        },
        {
          title:
            "Так же компания имеет в собственности отдельное офисное помещение",
          img: require("../assets/img/about-2.png"),
          text: "<p> Производственную базу, более 50-ти единиц дорожно-строительной техники и автотранспорта, собственную сертифицированную и аккредитованную лабораторию и службу контроля на строительстве. <br /> <br /> В истории дорожного строительства компании «ДАФ» насчитывается множество сданных объектов по ремонту и строительству как федеральных, региональных и муниципальных значений, так и коммерческих. Сегодня компания ведет ряд проектов с внедрением новых технологий строительства и применением инновационных материалов. За годы работы в компании сформировался надежный, профессиональный, амбициозный и высококвалифицированный коллектив, с богатым опытом и желанием строить и гордиться достигнутыми результатами. <br /> <br / Мы уважаем наших партнеров и заказчиков и от всей души желаем процветания Вашему бизнесу и воплощения в жизнь всех Ваших идей и возможностей! </p>",
        },
      ],
    };
  },
};
</script>

<style scoped>
</style>